
//音乐播放器Aplayer
import 'APlayer/dist/APlayer.min.css';
import APlayer from 'APlayer';

const div = document.createElement('div')
div.setAttribute('id', 'aplayer')
document.getElementById('__next').appendChild(div)
const audios_data = [
  {
      "title": "イチリンソウ",
      "artist": "山本彩",
      "cover": "https://p1.music.126.net/PTW4NHQuiznTQjdvLSc6BA==/109951164004552234.jpg",
      "music_file_url": "http://resume.wyfs.top/%E3%82%A4%E3%83%81%E3%83%AA%E3%83%B3%E3%82%BD%E3%82%A6.mp3",
      "lrc": "[ar:山本彩]\n[al:イチリンソウ]\n[ti:イチリンソウ]\n[00:00.000] 作曲 : 山本彩\n[00:00.000] 作词 : 山本彩\n[00:00.000]\n[00:00.800]ただ俯いて歩いていた　僕は春を見落としてた\n[00:10.590]どれくらい時が経ったのだろう　桜の花びらが舞っていた\n[00:20.710]すぐに忘れられるはずだ\n[00:29.620]胸の奥にしまい込んで　日向を探すの\n[00:39.200]こんな道の脇　咲いていた　あなたはひとりきり\n[00:45.800]真っ直ぐに　煌めいて　強く強く\n[00:50.480]いつの日か　枯れること　知ってるかのように\n[00:55.790]今という瞬間を　儚く生きてる\n[01:15.310]そういえばあの時も今日と同じような季節だった\n[01:24.909]どこからも光が失われ　何もかもがどうでもよかった\n[01:34.900]いつでも傷つかない事が\n[01:43.720]強くなれるという事ではないと分かったよ\n[01:53.379]いつも　気が付けば探してた　あなたの事だけを\n[02:00.049]会えた時　強くなれる気がした\n[02:04.640]雨に濡れ　踏まれても　咲く場所を変えない\n[02:09.949]堂々と咲き誇る姿が今もずっと\n[02:20.900]変わらない僕の道標\n[02:27.500]ただ俯いて歩いていた　僕は春を見落としてた\n[02:36.620]桜の影に隠れてそっと　揺れていた白い妖精\n[02:47.879]こんな道の脇　咲いていた　一輪草のように\n[02:54.449]ひとりでも　咲ける花になりたい\n[02:59.129]雨に濡れ　踏まれても　咲く場所を変えずに\n[03:04.319]堂々と咲き誇れるような\n[03:08.930]また次の春が来たら　あなたに会いたい\n[03:13.939]その時は今よりも　強くなった僕だ\n[03:23.939]",
      "show": true,
      "upload_date": "2019-04-20T11:19:55.171Z",
      "__v": 0
  },
  {
      "title": "夕焼けの歌",
      "artist": "近藤真彦",
      "cover": "https://p1.music.126.net/5QDdzESxuCyHPFlK2fpSww==/942281465029051.jpg",
      "music_file_url": "http://resume.wyfs.top/%E5%A4%95%E7%84%BC%E3%81%91%E3%81%AE%E6%AD%8C.mp3",
      "lrc": "[ti:夕焼けの歌]\n[ar:近藤真彦]\n[al:Matchy Best]\n[00:16.330]“あばよ”と この手も振らずに\n[00:23.160]飛び出したガラクタの町\n[00:30.060]あんなに憎んだすべてが\n[00:37.290]やりきれず しみるのは何故か\n[00:44.460]憧れた夢さえ\n[00:48.030]まだ報われずに\n[00:51.740]人恋しさに泣けば…\n[00:58.720]ゆらゆらとビルの都会に広が\n[01:05.930]あの頃と同じ 夕焼け空\n[01:15.050]クソ食らえとただ\n[01:17.500]アスファルト蹴りつけ\n[01:20.870]あぁ春夏秋…と\n[01:27.580]\n[02:01.100]この都会 誰れを迎い入れ\n[02:09.030]また誰れを追い出すのだろう\n[02:16.220]はじめて恋したお前は\n[02:22.510]俺の目が 好きと言ったのに\n[02:28.030]握りしめたこぶしが\n[02:34.400]空振りする度\n[02:39.820]何が宝と言えば…\n[02:44.360]ゆらゆらと俺の頬に焼きつく\n[02:51.660]あの頃と同じ 夕焼け空\n[02:59.360]土下座したいほど\n[03:03.170]愛が欲しいだけ\n[03:06.580]あぁ春夏秋…も\n[03:11.020]\n[03:26.210]Ｏh 弱虫の涙が\n[03:32.620]こぼれないように\n[03:41.250]空を見上げ 歩け\n[03:43.660]ゆらゆらとビルの都会に広がる\n[03:50.860]あの頃と同じ 夕焼け空\n[03:59.310]クソ食らえとただ\n[04:00.320]アスファルト蹴りつけ\n[04:07.790]あぁ春夏秋…と\n[04:14.450]ゆらゆらと俺の頬に焼きつく\n[04:20.660]あの頃と同じ 夕焼け空\n[04:27.040]土下座したいほど\n[04:32.520]愛が欲しいだけ\n[04:36.250]あぁ春夏秋…も",
      "show": true,
      "upload_date": "2019-04-13T11:43:46.277Z",
      "__v": 0
  },
  {
      "title": "水色",
      "artist": "UA",
      "cover": "https://p2.music.126.net/UXtA80ZP9jnYK5O6uw2aag==/109951164515102848.jpg",
      "music_file_url": "http://resume.wyfs.top/%E6%B0%B4%E8%89%B2.mp3",
      "lrc": "[ti:水色]\n[al:Illuminate ~the very best songs~]\n[ar:UA (ウーア)]\n[offset:0]\n[length:291]\n[00:00.000]水色 - UA (ウーア)\n[00:25.850]想いは水色の雫の中で揺れてる\n[00:35.730]\n[00:37.170]三日月が手のひらに浮かぶ この夜に\n[00:46.230]\n[00:48.040]今ひとたびの　言葉だけ\n[00:53.420]\n[00:54.100]貴方に伝えましょう\n[00:58.290]\n[01:00.670]溶けては\n[01:02.290]\n[01:03.040]染みわたるほのかな夜の吐息よ\n[01:10.910]\n[01:12.170]愛しい涙色の声で泣く虫と\n[01:21.370]\n[01:23.120]闇夜を照らす星達の\n[01:28.430]\n[01:29.120]心に憧れて\n[01:32.740]\n[01:35.740]悪戯な花びら\n[01:44.550]\n[01:47.360]遥か遠い雲の便り\n[01:56.960]\n[01:58.960]わたしは　水色の翼\n[02:05.710]大空に広げ\n[02:09.460]\n[02:10.520]疲れて飛べない日は\n[02:15.390]\n[02:16.710]大きな木に止まり\n[02:20.080]\n[02:21.770]愛の言葉と風の唄\n[02:26.960]\n[02:27.640]貴方にうたいましょう\n[02:31.830]\n[02:51.580]季節は限りなく\n[02:56.270]\n[02:56.960]回り続けてるけど\n[03:02.080]\n[03:03.210]わたしのこの心に\n[03:08.020]\n[03:09.210]光る水色は\n[03:12.520]\n[03:14.520]いついつまでも\n[03:16.840]\n[03:17.770]変わらない　空と海の色\n[03:24.020]\n[03:26.770]思い出よ　ありがとう\n[03:36.090]\n[03:38.330]白い波が 頬を濡らす\n[03:48.020]\n[03:50.270]青い地球がまぶしすぎて",
      "show": true,
      "upload_date": "2019-02-12T10:00:55.247Z",
      "__v": 0
  },
]

const aduios = audios_data.map((item) => {
  return {
    name: item.title,
    artist: item.artist,
    url: item.music_file_url,
    cover: item.cover,
    lrc: item.lrc,
    theme: '#ebd0c2'
  }
})

new APlayer({
  container: document.getElementById('aplayer'),
  fixed: true,
  lrcType: 1,
  audio: aduios
});
const APlayerComponent = () => {
  return <div></div>
}

export default APlayerComponent